# Assignment 3 - Pandas DataFrame
## Part 1 (75 Points evenly distributed to first three questions)
The following code loads the olympics dataset (olympics.csv), which was derived from the Wikipedia entry on [All Time Olympic Games Medals](https://en.wikipedia.org/wiki/All-time_Olympic_Games_medal_table), and does some basic data cleaning. 

The columns are organized as # of Summer games, Summer medals, # of Winter games, Winter medals, total # number of games, total # of medals. Use this dataset to answer the questions below.

In [ ]:
import pandas as pd

df = pd.read_csv('olympics.csv', index_col=0, skiprows=1)

for col in df.columns:
    if col[:2]=='01':
        df.rename(columns={col:'Gold'+col[4:]}, inplace=True)
    if col[:2]=='02':
        df.rename(columns={col:'Silver'+col[4:]}, inplace=True)
    if col[:2]=='03':
        df.rename(columns={col:'Bronze'+col[4:]}, inplace=True)
    if col[:1]=='№':
        df.rename(columns={col:'#'+col[1:]}, inplace=True)

names_ids = df.index.str.split('\s\(') # split the index by '('

df.index = names_ids.str[0] # the [0] element is the country name (new index) 
df['ID'] = names_ids.str[1].str[:3] # the [1] element is the abbreviation or ID (take first 3 characters from that)

df = df.drop('Totals')
df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,ID
Afghanistan,13,0,0,2,2,0,0,0,0,0,13,0,0,2,2,AFG
Algeria,12,5,2,8,15,3,0,0,0,0,15,5,2,8,15,ALG
Argentina,23,18,24,28,70,18,0,0,0,0,41,18,24,28,70,ARG
Armenia,5,1,2,9,12,6,0,0,0,0,11,1,2,9,12,ARM
Australasia,2,3,4,5,12,0,0,0,0,0,2,3,4,5,12,ANZ

### Question 1 

What is the first country in df?

*This function should return a Series.*

In [ ]:
# You should write your whole answer within the function provided. 
def answer_zero():
    # This function should return the row for the first country, which is a Series object.
    return(df.iloc[0,:])

# You can examine what your function returns by calling it in the cell. 
answer_zero()

# Summer           13
Gold                0
Silver              0
Bronze              2
Total               2
# Winter            0
Gold.1              0
Silver.1            0
Bronze.1            0
Total.1             0
# Games            13
Gold.2              0
Silver.2            0
Bronze.2            2
Combined total      2
ID                AFG
Name: Afghanistan, dtype: object

### Question 2
In summer games, which nation has won the most gold medals?


*This function should return a single string value.*

In [ ]:
def answer_one():
    return(df['Gold'].idxmax())
    
answer_one()

'United States'

### Question 3
Which nation had the biggest difference on gold medal counts? (between their summer and winter) 

*This function should return a single string value.*

In [ ]:
def answer_one():
    return(pd.DataFrame(df['Gold']-df['Gold.1'])[0].idxmax())

answer_one()

'United States'

# PART 2
## Question 4 (25 Points for first two questions + 25 Points Bonus for last two questions)

We will look at the publicly available airline data in this question similar to flights.csv that we covered in class practices. However, in this assignment, you are given 6 months of seperate data along with lookup tables for carriers and airports. Please apply data exploration and pre-procesing techniques and provide your answers for the following questions.



Questions: 

    1. What carrier has flown the 1st most number of flights? How many?  
    2. Which airport has the 3rd most delays? 
    3. What is the most popular day of the week to travel?
    4. What is the 1st and 5th most flown route? 

Hints:

1- pd.concat(list)
list=[A,B,C...] e.g. A= pd.read_csv("1.csv",encoding='utf-8')

2-please leverage from pandas dataframe features including 
groupby(...).size()...
groupby(...).sum().sort_values(....)

3- Dont forget to consider cancelled flights

4- Try to create a new column for "route"

Dataset Details: 
Dataset name: On-Time Performance,
Lookup Table: Carrier Lookup,
Lookup Table: Airport Lookup

In [ ]:
#Importing the Data
import pandas as pd

df1 = pd.read_csv('1.csv',encoding='utf-8')
df2 = pd.read_csv('2.csv',encoding='utf-8')
df3 = pd.read_csv('3.csv',encoding='utf-8')
df4 = pd.read_csv('4.csv',encoding='utf-8')
df5 = pd.read_csv('5.csv',encoding='utf-8')
df6 = pd.read_csv('6.csv',encoding='utf-8')
frames=[df1,df2,df3,df4,df5,df6]
df_f = pd.concat(frames)

In [ ]:
df_f.head()

,FL_DATE,UNIQUE_CARRIER,AIRLINE_ID,CARRIER,TAIL_NUM,FL_NUM,ORIGIN_AIRPORT_ID,ORIGIN_AIRPORT_SEQ_ID,ORIGIN_CITY_MARKET_ID,ORIGIN,...,ARR_TIME_BLK,CANCELLED,DIVERTED,CRS_ELAPSED_TIME,ACTUAL_ELAPSED_TIME,AIR_TIME,FLIGHTS,DISTANCE,DISTANCE_GROUP,Unnamed: 50
0,2014-01-01,AA,19805,AA,N002AA,2377,12278,1227802,30928,ICT,...,1300-1359,0.0,0.0,85.0,78.0,57.0,1.0,328.0,2,NaN
1,2014-01-01,AA,19805,AA,N3FXAA,2378,13303,1330303,32467,MIA,...,2300-2359,0.0,0.0,60.0,55.0,37.0,1.0,204.0,1,NaN
2,2014-01-01,EV,20366,EV,N906EV,2500,11298,1129803,30194,DFW,...,2200-2259,1.0,0.0,60.0,NaN,NaN,1.0,247.0,1,NaN
3,2014-01-01,EV,20366,EV,N903EV,2502,11146,1114603,31146,CRW,...,1900-1959,0.0,0.0,185.0,180.0,150.0,1.0,946.0,4,NaN
4,2014-01-01,EV,20366,EV,N903EV,2502,11298,1129803,30194,DFW,...,1600-1659,0.0,0.0,125.0,115.0,101.0,1.0,946.0,4,NaN

In [ ]:
df_f.columns

Index(['FL_DATE', 'UNIQUE_CARRIER', 'AIRLINE_ID', 'CARRIER', 'TAIL_NUM',
       'FL_NUM', 'ORIGIN_AIRPORT_ID', 'ORIGIN_AIRPORT_SEQ_ID',
       'ORIGIN_CITY_MARKET_ID', 'ORIGIN', 'ORIGIN_CITY_NAME',
       'ORIGIN_STATE_ABR', 'ORIGIN_STATE_FIPS', 'ORIGIN_STATE_NM',
       'ORIGIN_WAC', 'DEST_AIRPORT_ID', 'DEST_AIRPORT_SEQ_ID',
       'DEST_CITY_MARKET_ID', 'DEST', 'DEST_CITY_NAME', 'DEST_STATE_ABR',
       'DEST_STATE_FIPS', 'DEST_STATE_NM', 'DEST_WAC', 'CRS_DEP_TIME',
       'DEP_TIME', 'DEP_DELAY', 'DEP_DELAY_NEW', 'DEP_DEL15',
       'DEP_DELAY_GROUP', 'DEP_TIME_BLK', 'TAXI_OUT', 'WHEELS_OFF',
       'WHEELS_ON', 'TAXI_IN', 'CRS_ARR_TIME', 'ARR_TIME', 'ARR_DELAY',
       'ARR_DELAY_NEW', 'ARR_DEL15', 'ARR_DELAY_GROUP', 'ARR_TIME_BLK',
       'CANCELLED', 'DIVERTED', 'CRS_ELAPSED_TIME', 'ACTUAL_ELAPSED_TIME',
       'AIR_TIME', 'FLIGHTS', 'DISTANCE', 'DISTANCE_GROUP', 'Unnamed: 50'],
      dtype='object')

In [ ]:
carrier_df=pd.read_csv('Lookup Tables\L_CARRIER_HISTORY.csv',encoding='utf-8')
carrier_df.head()

  Code                              Description
0  02Q                  Titan Airways (2006 - )
1  04Q             Tradewind Aviation (2006 - )
2  05Q        Comlux Aviation, AG (2006 - 2012)
3  06Q  Master Top Linhas Aereas Ltd. (2007 - )
4  07Q            Flair Airlines Ltd. (2007 - )

In [ ]:
airport_df=pd.read_csv('Lookup Tables\L_AIRPORT_ID.csv',encoding='utf-8')
airport_df.head()

    Code                                    Description
0  10001         Afognak Lake, AK: Afognak Lake Airport
1  10003  Granite Mountain, AK: Bear Creek Mining Strip
2  10004                       Lik, AK: Lik Mining Camp
3  10005         Little Squaw, AK: Little Squaw Airport
4  10006                     Kizhuyak, AK: Kizhuyak Bay

### Question 1 What carrier has flown the 1st most number of flights? How many?

In [ ]:
top_carrier = df_f[df_f['CANCELLED']== 0].groupby('CARRIER').count().sort_values(by = 'FL_DATE', ascending = False)['FL_DATE']
top_carrier_name = carrier_df[carrier_df['Code']==top_carrier.keys()[0]]
print("The carrier with the top number of flights is {} having achieved {} flights.".format(top_carrier_name.iloc[0,1], top_carrier[0]))

The carrier with the top number of flights is Southwest Airlines Co. (1979 - ) having achieved 568904 flights.

### Question 2 Which airport has the 3rd most delays?

In [ ]:
top_airport_delay = df_f[df_f['DEP_DELAY']> 0].groupby('ORIGIN_AIRPORT_ID').count().sort_values(by = 'FL_DATE', ascending = False)['FL_DATE']
third_airport_name = airport_df[airport_df['Code']==top_airport_delay.keys()[2]]
print("The third airport with the most delayed flights is {}.".format(third_airport_name.iloc[0,1]))

The third airport with the most delayed flights is Denver, CO: Denver International.

### What is the most popular day of the week to travel?

In [ ]:
date_df = df_f[['FL_DATE']].set_index(df_f['FL_DATE'])
date_df.index = pd.to_datetime(date_df.index)
date_df['WEEKDAY'] = date_df.index.weekday
weekday_df = date_df.groupby('WEEKDAY').count()
weekday_df.index = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
print("The most popular day of the week to travel is: {}.".format(weekday_df['FL_DATE'].idxmax()))

The most popular day of the week to travel is: Friday.

### What is the 1st and 5th most flown route?

In [ ]:
# Create new column of type string that includes the origin and destination airport ID
df_f['ROUTE'] = df_f['ORIGIN_AIRPORT_ID'].astype(str) + '_' + df_f['DEST_AIRPORT_ID'].astype(str)

In [ ]:
# group the records by routes and sort them by count of records. Then create a list having the origin and destination airport of 1st and 5th top routes 
top_routes = df_f[df_f['CANCELLED']== 0].groupby('ROUTE').count().sort_values(by = 'FL_DATE', ascending = False)['FL_DATE']
first_fifth_df = pd.DataFrame(top_routes[0::4][0:2])
first_fifth_route = first_fifth_df.index.str.split("_", n = 1, expand = True)

In [ ]:
print("The 1st most flown route is {} - {}.".format(airport_df[airport_df['Code']== int(first_fifth_route[0][0])].iloc[0,1], 
airport_df[airport_df['Code']== int(first_fifth_route[0][1])].iloc[0,1]))
print("The 5th most flown route is {} - {}.".format(airport_df[airport_df['Code']== int(first_fifth_route[1][0])].iloc[0,1], 
airport_df[airport_df['Code']== int(first_fifth_route[1][1])].iloc[0,1]))

The 1st most flown route is San Francisco, CA: San Francisco International - Los Angeles, CA: Los Angeles International.
The 5th most flown route is New York, NY: John F. Kennedy International - Los Angeles, CA: Los Angeles International.